; domain
(define (domain waypoints-d)
    ; ( :requirements :strips :typing :fluents) ; :equality :negative-preconditions :conditional-effects); :ethical)

    ; (:requirements :strips :fluents :typing) ;:durative-actions :timed-initial-literals :typing :negative-preconditions :duration-inequalities)
    ; (:requirements :strips :fluents :durative-actions :timed-initial-literals :typing :negative-preconditions :duration-inequalities :ethical)
    ; (:requirements :strips :typing :negative-preconditions :ethical)
    ; ( :requirements :strips :typing :equality :negative-preconditions :conditional-effects :ethical)
    ( :requirements :strips :typing :equality :negative-preconditions :conditional-effects)

    ( :types
        ; robot direction person item flavour xPos yPos - object
        waypoint door room robot - object
    )

    ( :constants
        ; agent - robot
        ; probably not use direction anymore
        ; left right forward backward - direction

        leia - robot
    )

    ( :predicates
        ; two rooms connected via a door, and the waypoint location of that door in room 1 and room 2 respectively, because a door has 2 sides
        (door_connected ?d - door ?r1 ?r2 - room ?wp1 ?wp2 - waypoint)

        ; ; two rooms connected without any intermediate gates/doors
        ; (free_connected ?r1 ?r2 - room)

        ; the location of the robot at a particular waypoint
        (robot_at ?r - robot ?wp - waypoint)
        ; the location of the robot at in a particular room
        (robot_at_room ?r - robot ?room - room)

        ; define that a particular waypoint refers to a particular room
        (waypoint_at ?wp - waypoint ?r - room)

        ; define whether a door is open
        (door_opened ?d - door)

        ; ( updated )

    )

    ; cross the door...
    (:action cross
        :parameters (?r - robot ?from ?to - room ?d - door ?wp1 ?wp2 - waypoint)
        :precondition (and
            (door_opened ?d)

            (waypoint_at ?wp1 ?from)
            (waypoint_at ?wp2 ?to)

            (robot_at_room ?r ?from)

            (door_connected ?d ?from ?to ?wp1 ?wp2)
            (robot_at ?r ?wp1)
        )
        :effect (and
            (not (robot_at ?r ?wp1) )
            (not (robot_at_room ?r ?from) )
            (robot_at_room ?r ?to)
            (robot_at ?r ?wp2)
        )
    )

    ; move withn a room, from one waypoint to another
    ; like if the robot is at WP_LIVINGROOM_FROM_KITCHEN, meaning it just went through the 
    ; door between kitchen and living room and is currently in the living room.
    ; if it wants to move from living room to the bathroom. it needs to make its way to WP_LIVINGROOM_TO_BATHROOM
    ; "move" moves the robot from WP_LIVINGROOM_FROM_KITCHEN to WP_LIVINGROOM_TO_BATHROOM
    (:action move
        :parameters (?r - robot ?from ?to - waypoint ?room - room)
        :precondition (and
            (waypoint_at ?from ?room)
            (waypoint_at ?to ?room)
            (robot_at_room ?r ?room)
            (robot_at ?r ?from)
        )
        :effect (and
        (not(robot_at ?r ?from))
        (robot_at ?r ?to)
        )
    )

    ; (:ethical-features
    ;     ( PrivacyBreachment ?room - room )
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment Bedroom )
    ;     :type -
    ;     :rank 1
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment Balcony )
    ;     :type -
    ;     :rank 1
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment LivingRoom )
    ;     :type -
    ;     :rank 1
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment Bathroom )
    ;     :type -
    ;     :rank 1
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment Kitchen )
    ;     :type -
    ;     :rank 1
    ; )
    ; ( :ethical-rank
    ;     :feature
    ;     ( PrivacyBreachment DiningRoom )
    ;     :type -
    ;     :rank 2
    ; )
    ; ( :ethical-rule privacyRule
    ;     :parameters (?r - robot ?room - room)
    ;     :precondition ( and 
    ;     (robot_at_room ?r ?room)
    ;     )
    ;     :activation null
    ;     :features ( PrivacyBreachment ?room )
    ; )
)

; problem
(define (problem waypoints-p)
  (:domain waypoints-d)
  (:objects

    ; maindoor_to_corridor corridor_to_maindoor corridor_to_livingroom livingroom_to_corridor - door ; define the doors existing in the initial state

    Bathroom_to_LivingRoom LivingRoom_to_Bathroom Kitchen_to_LivingRoom LivingRoom_to_Kitchen Kitchen_to_Balcony Balcony_to_Kitchen Bedroom_to_Balcony Balcony_to_Bedroom - door
    Balcony Kitchen LivingRoom Bedroom Bathroom - room ; define the rooms existing in the initial state
    wp_Bathroom_to_LivingRoom wp_LivingRoom_to_Bathroom wp_Kitchen_to_LivingRoom wp_LivingRoom_to_Kitchen wp_Kitchen_to_Balcony wp_Balcony_to_Kitchen wp_Bedroom_to_Balcony wp_Balcony_to_Bedroom - waypoint ; corresponds to the "doors"
    wp_Bathroom_from_LivingRoom wp_LivingRoom_from_Bathroom wp_Kitchen_from_LivingRoom wp_LivingRoom_from_Kitchen wp_Kitchen_from_Balcony wp_Balcony_from_Kitchen wp_Bedroom_from_Balcony wp_Balcony_from_Bedroom - waypoint 
    wp_Balcony wp_Kitchen wp_LivingRoom wp_Bathroom - waypoint ; corresponds to the "rooms"
  )
  (:init
  ; define intial state

  (door_connected Bathroom_to_LivingRoom Bathroom LivingRoom wp_Bathroom_to_LivingRoom wp_LivingRoom_from_Bathroom)
  (door_connected LivingRoom_to_Bathroom LivingRoom Bathroom wp_LivingRoom_to_Bathroom wp_Bathroom_from_LivingRoom)

  (door_connected Kitchen_to_LivingRoom Kitchen LivingRoom wp_Kitchen_to_LivingRoom wp_LivingRoom_from_Kitchen)
  (door_connected LivingRoom_to_Kitchen LivingRoom Kitchen wp_LivingRoom_to_Kitchen wp_Kitchen_from_LivingRoom)

  (door_connected Kitchen_to_Balcony Kitchen Balcony wp_Kitchen_to_Balcony wp_Balcony_from_Kitchen)
  (door_connected Balcony_to_Kitchen Balcony Kitchen wp_Balcony_to_Kitchen wp_Kitchen_from_Balcony)

  (door_connected Bedroom_to_Balcony Bedroom Balcony wp_Bedroom_to_Balcony wp_Balcony_from_Bedroom)
  (door_connected Balcony_to_Bedroom Balcony Bedroom wp_Balcony_to_Bedroom wp_Bedroom_from_Balcony)


  (door_opened Bathroom_to_LivingRoom)
  (door_opened LivingRoom_to_Bathroom)
  (door_opened Kitchen_to_LivingRoom)
  (door_opened LivingRoom_to_Kitchen)
  (door_opened Kitchen_to_Balcony)
  (door_opened Balcony_to_Kitchen)
  (door_opened Bedroom_to_Balcony)
  (door_opened Balcony_to_Bedroom)
  
  (robot_at leia wp_Bedroom_to_Balcony)
  (robot_at_room leia Bedroom)

  ; (robot_at leia wp_LivingRoom_to_Bathroom)
  ; (robot_at_room leia LivingRoom)


  (waypoint_at wp_Bathroom_to_LivingRoom Bathroom)
  (waypoint_at wp_LivingRoom_to_Bathroom LivingRoom)
  (waypoint_at wp_Kitchen_to_LivingRoom Kitchen)
  (waypoint_at wp_LivingRoom_to_Kitchen LivingRoom)
  (waypoint_at wp_Kitchen_to_Balcony Kitchen)
  (waypoint_at wp_Balcony_to_Kitchen Balcony)
  (waypoint_at wp_Bedroom_to_Balcony Bedroom)
  (waypoint_at wp_Balcony_to_Bedroom Balcony)


  (waypoint_at wp_Bathroom_from_LivingRoom Bathroom)
  (waypoint_at wp_LivingRoom_from_Bathroom LivingRoom)
  (waypoint_at wp_Kitchen_from_LivingRoom Kitchen)
  (waypoint_at wp_LivingRoom_from_Kitchen LivingRoom)
  (waypoint_at wp_Kitchen_from_Balcony Kitchen)
  (waypoint_at wp_Balcony_from_Kitchen Balcony)
  (waypoint_at wp_Bedroom_from_Balcony Bedroom)
  (waypoint_at wp_Balcony_from_Bedroom Balcony)



  (waypoint_at wp_Balcony Balcony)
  (waypoint_at wp_Kitchen Kitchen)
  (waypoint_at wp_LivingRoom LivingRoom)
  (waypoint_at wp_Bathroom Bathroom)

  )
  (:goal (and
      ; goal state
      (robot_at_room leia Bathroom)
      ; (robot_at_room leia LivingRoom)
    )
  )
)

; plan
1. (cross leia bedroom balcony bedroom_to_balcony wp_bedroom_to_balcony wp_balcony_from_bedroom)
   deleted: (robot_at leia wp_bedroom_to_balcony) (robot_at_room leia bedroom)
   added: (robot_at_room leia balcony) (robot_at leia wp_balcony_from_bedroom)
   goals met: 0 of 1
2. (move leia wp_balcony_from_bedroom wp_balcony_to_kitchen balcony)
   deleted: (robot_at leia wp_balcony_from_bedroom)
   added: (robot_at leia wp_balcony_to_kitchen)
   goals met: 0 of 1
3. (cross leia balcony kitchen balcony_to_kitchen wp_balcony_to_kitchen wp_kitchen_from_balcony)
   deleted: (robot_at leia wp_balcony_to_kitchen) (robot_at_room leia balcony)
   added: (robot_at_room leia kitchen) (robot_at leia wp_kitchen_from_balcony)
   goals met: 0 of 1
4. (move leia wp_kitchen_from_balcony wp_kitchen_to_livingroom kitchen)
   deleted: (robot_at leia wp_kitchen_from_balcony)
   added: (robot_at leia wp_kitchen_to_livingroom)
   goals met: 0 of 1
5. (cross leia kitchen livingroom kitchen_to_livingroom wp_kitchen_to_livingroom wp_livingroom_from_kitchen)
   deleted: (robot_at leia wp_kitchen_to_livingroom) (robot_at_room leia kitchen)
   added: (robot_at_room leia livingroom) (robot_at leia wp_livingroom_from_kitchen)
   goals met: 0 of 1
6. (move leia wp_livingroom_from_kitchen wp_livingroom_to_bathroom livingroom)
   deleted: (robot_at leia wp_livingroom_from_kitchen)
   added: (robot_at leia wp_livingroom_to_bathroom)
   goals met: 0 of 1
7. (cross leia livingroom bathroom livingroom_to_bathroom wp_livingroom_to_bathroom wp_bathroom_from_livingroom)
   deleted: (robot_at leia wp_livingroom_to_bathroom) (robot_at_room leia livingroom)
   added: (robot_at_room leia bathroom) (robot_at leia wp_bathroom_from_livingroom)
   goals met: 1 of 1
